<?php

// resources/lang/ru/admin/controllers/articles.php

return [

    // Общие действия
    'created' => 'Статья успешно создана.',
    'updated' => 'Статья успешно обновлена.',
    'deleted' => 'Статья и связанные изображения удалены.',
    'create_error' => 'Произошла ошибка при создании статьи.',
    'update_error' => 'Произошла ошибка при обновлении статьи.',
    'delete_error' => 'Произошла ошибка при удалении статьи.',
    'index_error' => 'Не удалось загрузить список постов.',

    // Массовые операции
    'bulk_deleted' => 'Выбранные статьи (:count шт.) успешно удалены.',
    'bulk_delete_error' => 'Произошла ошибка при массовом удалении статей.',
    'bulk_left_update_error' => 'Ошибка массового обновления активности в левой колонке.',
    'bulk_main_update_error' => 'Ошибка массового обновления активности в главной колонке.',
    'bulk_right_update_error' => 'Ошибка массового обновления активности в правой колонке.',

    // Активность
    'activated' => 'активирована',
    'deactivated' => 'деактивирована',
    'activity' => 'Статья ":title" была :action.',
    'update_activity_error' => 'Произошла ошибка при обновлении активности.',

    // Сортировка
    'update_sort_success' => 'Сортировка статьи успешно обновлена.',
    'update_sort_error' => 'Ошибка обновления сортировки статьи.',
    'bulk_sort_updated' => 'Порядок статей успешно обновлен.',
    'bulk_sort_update_error' => 'Ошибка массового обновления порядка статей.',

    // Клонирование
    'cloned' => 'Статья успешно клонирована.',
    'clone_error' => 'Ошибка клонирования статьи.',

    // Левый, правый сайдбар и главная
    'left_updated' => 'Статья успешно обновлена в левой колонке.',
    'right_updated' => 'Статья успешно обновлена в правой колонке.',
    'main_updated' => 'Статья успешно обновлена в главной колонке.',
    'left_update_error' => 'Ошибка обновления активности в левой колонке.',
    'right_update_error' => 'Ошибка обновления активности в правой колонке.',
    'main_update_error' => 'Ошибка обновления активности в главной колонке.',

];
