<?php

// resources/lang/ru/admin/controllers/banners.php

return [

    // Общие действия
    'created' => 'Баннер успешно создан.',
    'updated' => 'Баннер успешно обновлен.',
    'deleted' => 'Баннер и связанные изображения удалены.',
    'create_error' => 'Произошла ошибка при создании баннера.',
    'update_error' => 'Произошла ошибка при обновлении баннера.',
    'delete_error' => 'Произошла ошибка при удалении баннера.',

    // Массовые операции
    'bulk_deleted' => 'Выбранные баннеры (:count шт.) успешно удалены.',
    'bulk_delete_error' => 'Произошла ошибка при массовом удалении баннеров.',

    // Активность
    'activated' => 'активирован',
    'deactivated' => 'деактивирован',
    'activity' => 'Баннер ":title" был :action.',
    'update_activity_error' => 'Произошла ошибка при обновлении активности.',

    // Сортировка
    'update_sort_error' => 'Не удалось обновить сортировку.',
    'bulk_update_sort_error' => 'Ошибка массового обновления порядка баннеров.',

    // Левый, правый сайдбар
    'updated_left_success' => 'Выбранные баннеры успешно активированы в левой колонке.',
    'updated_right_success' => 'Выбранные баннеры успешно активированы в правой колонке.',
    'updated_left_error' => 'Ошибка обновления активности в левой колонке.',
    'updated_right_error' => 'Ошибка обновления активности в правой колонке.',

];
