<?php

// resources/lang/ru/admin/controllers/plugins.php

return [

    // Общие действия
    'created' => 'Модуль успешно создан.',
    'updated' => 'Модуль успешно обновлен.',
    'deleted' => 'Модуль успешно удален.',

    // Ошибки создания/обновления/удаления
    'create_error' => 'Произошла ошибка при создании модуля.',
    'update_error' => 'Произошла ошибка при обновлении модуля.',
    'delete_error' => 'Произошла ошибка при удалении модуля.',

    // Загрузка списка
    'index_load_error' => 'Не удалось загрузить список модулей.',

    // Активность
    'activated' => 'активирован',
    'deactivated' => 'деактивирован',
    'activity' => 'Модуль ":title" был :action.',

    // Ошибки активности
    'update_activity_error' => 'Произошла ошибка при обновлении активности модуля.',

    // Сортировка
    'update_sort_error' => 'Не удалось обновить сортировку модуля.',
    'update_sort_bulk_error' => 'Не удалось обновить порядок модулей.',

];
