<?php

// resources/lang/ru/admin/controllers/users.php

return [

    // Общие действия
    'created' => 'Пользователь успешно создан.',
    'create_error' => 'Произошла ошибка при создании пользователя.',

    'updated' => 'Пользователь успешно обновлён.',
    'update_error' => 'Произошла ошибка при обновлении пользователя.',

    'deleted' => 'Пользователь успешно удалён.',
    'delete_error' => 'Произошла ошибка при удалении пользователя.',

    'cannot_delete_superadmin' => 'Нельзя удалить администратора.',
    'cannot_delete_main_admin' => 'Удаление основного администратора запрещено.',
    'cannot_delete_single_admin' => 'Нельзя удалить пользователя с единственной ролью admin.',
];
