// resources/js/utils/transliteration.js

const dictionary = {
    'а': 'a', 'ә': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'ғ': 'gh', 'д': 'd', 'е': 'e', 'ё': 'e',
    'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'қ': 'q', 'л': 'l', 'м': 'm', 'н': 'n',
    'ң': 'ng', 'о': 'o', 'ө': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ұ': 'u',
    'ү': 'u', 'ф': 'f', 'х': 'kh', 'һ': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch',
    'ы': 'y', 'і': 'i', 'э': 'e', 'ю': 'yu', 'я': 'ya', 'ь': '', 'ъ': '', ' ': '-'
};

export const transliterate = (text) => {
    return text
        .toLowerCase() // Приводим к нижнему регистру
        .split('')
        .map(char => dictionary[char] || char) // Применяем транслитерацию
        .join('')
        .replace(/-+/g, '-') // Убираем повторяющиеся тире ("---" -> "-")
        .replace(/[^a-z0-9-]/g, '') // Удаляем всё, кроме латинских букв, цифр и тире
        .replace(/^-+|-+$/g, ''); // Удаляем тире в начале и конце строки
};
