<?php

// resources/lang/kk/admin/requests/SettingRequest.php

return [
    'sort.integer' => 'Сұрыптау өрісі сан болуы керек.',
    'sort.min' => 'Сұрыптау өрісі теріс болуы мүмкін емес.',
    'activity.required' => 'Әрекет өрісі қажет.',
    'activity.boolean' => 'Әрекет өрісі логикалық мән болуы керек.',
    'type.in' => 'Жарамсыз өріс түрі таңдалды.',
    'option.required' => 'Опция қажет.',
    'option.unique' => 'Осы опциясы бар параметр бұрыннан бар.',
    'constant.required' => 'Тұрақты қажет.',
    'constant.unique' => 'Бұл тұрақты бар параметр бұрыннан бар.',
    'constant.regex' => 'Тұрақты латын бас әріпінен басталуы керек және тек БАС латын әріптерін, сандарды және астын сызуды қамтуы керек.',
];
