<?php
// resources/lang/kk/admin/controllers/articles.php

return [

    // Жалпы әрекеттер
    'created' => 'Мақала сәтті жасалды.',
    'updated' => 'Мақала сәтті жаңартылды.',
    'deleted' => 'Мақала және оған қатысты суреттер жойылды.',
    'create_error' => 'Мақаланы жасау кезінде қате орын алды.',
    'update_error' => 'Мақаланы жаңарту кезінде қате орын алды.',
    'delete_error' => 'Мақаланы жою кезінде қате орын алды.',
    'index_error' => 'Пост тізімі жүктелмеді.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған мақалалар (:count) сәтті жойылды.',
    'bulk_delete_error' => 'Мақалаларды жаппай жою кезінде қате орын алды.',
    'bulk_left_update_error' => 'Сол жақ бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_main_update_error' => 'Негізгі бағандағы әрекетті жаппай жаңарту қатесі.',
    'bulk_right_update_error' => 'Оң жақ бағандағы әрекетті жаппай жаңарту қатесі.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => '":title" мақаласы :әрекет болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_success' => 'Мақалаларды сұрыптау сәтті жаңартылды.',
    'update_sort_error' => 'Мақаланы сұрыптауды жаңарту қатесі.',
    'bulk_sort_updated' => 'Мақаланың реті сәтті жаңартылды.',
    'bulk_sort_update_error' => 'Мақала ретін жаппай жаңарту қатесі.',

    // Клондау
    'cloned' => 'Мақала сәтті клондалды.',
    'clone_error' => 'Мақаланы клондау қатесі.',

    // Сол, оң жақ бүйірлік тақта және негізгі
    'left_updated' => 'Мақала сол жақ бағанда сәтті жаңартылды.',
    'right_updated' => 'Мақала оң жақ бағанда сәтті жаңартылды.',
    'main_updated' => 'Мақала негізгі бағанда сәтті жаңартылды.',
    'left_update_error' => 'Сол жақ бағандағы әрекетті жаңарту қатесі.',
    'right_update_error' => 'Оң жақ бағандағы әрекетті жаңарту қатесі.',
    'main_update_error' => 'Негізгі бағандағы әрекетті жаңарту қатесі.',

];
