<?php

// resources/lang/kk/admin/controllers/banners.php

return [

    // Жалпы әрекеттер
    'created' => 'Баннер сәтті жасалды.',
    'updated' => 'Баннер сәтті жаңартылды.',
    'deleted' => 'Баннер және байланысты суреттер жойылды.',
    'create_error' => 'Баннер жасау кезінде қате орын алды.',
    'update_error' => 'Баннерді жаңарту кезінде қате орын алды.',
    'delete_error' => 'Баннерді жою кезінде қате орын алды.',

// Жаппай операциялар
    'bulk_deleted' => 'Таңдалған баннерлер (:санау дана) сәтті жойылды.',
    'bulk_delete_error' => 'Баннерлерді жаппай жою кезінде қате орын алды.',

// Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => 'Баннер ":title" :әрекет болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

// Сұрыптау
    'update_sort_error' => 'Сұрыптауды жаңарту мүмкін болмады.',
    'bulk_update_sort_error' => 'Баннер тәртібін жаппай жаңарту қатесі.',

// Сол, оң жақ бүйірлік тақта
    'updated_left_success' => 'Таңдалған баннерлер сол жақ бағанда сәтті іске қосылды.',
    'updated_right_success' => 'Таңдалған баннерлер оң жақ бағанда сәтті белсендірілді.',
    'updated_left_error' => 'Сол жақ бағандағы әрекетті жаңарту қатесі.',
    'updated_right_error' => 'Оң жақ бағандағы әрекетті жаңарту қатесі.',

];
