<?php

// resources/lang/kk/admin/controllers/parameters.php

return [

    'index_error' => 'Параметрлер тізімін жүктеу сәтсіз аяқталды.',

    // Жалпы әрекеттер
    'created' => 'Параметр сәтті жасалды.',
    'create_error' => 'Параметрді жасау кезінде қате орын алды.',
    'updated' => 'Параметр сәтті жаңартылды.',
    'update_error' => 'Параметрді жаңарту кезінде қате орын алды.',
    'deleted' => 'Параметр сәтті жойылды.',
    'delete_error' => 'Параметрді жою кезінде қате орын алды.',
    'deleted_success' => '":опция" параметрі сәтті жойылды.',

    // Әрекет
    'update_activity_success' => 'Параметр ":опция" сәтті :әрекет.',
    'activity_update_forbidden' => '":санат" санаты үшін әрекетті өзгертуге тыйым салынады.',
    'update_activity_error' => 'Параметр әрекетін жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_error' => 'Сұрыптауды жаңарту мүмкін болмады.',
    'bulk_update_sort_error' => 'Параметрлердің ретін жаңарту мүмкін болмады.',
];
