<?php

// resources/lang/kk/admin/controllers/sections.php

return [

    // Жалпы әрекеттер
    'created' => 'Бөлім сәтті жасалды.',
    'create_error' => 'Бөлімді құру кезінде қате орын алды.',
    'updated' => 'Бөлім сәтті жаңартылды.',
    'update_error' => 'Бөлімді жаңарту кезінде қате орын алды.',
    'deleted' => 'Бөлім сәтті жойылды.',
    'delete_error' => 'Бөлімді жою кезінде қате орын алды.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған бөлімдер (:санау дана) сәтті жойылды.',
    'bulk_delete_error' => 'Бөлімдерді жою кезінде қате орын алды.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => '":title" бөлімі :әрекет болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_error' => 'Сұрыптауды жаңарту мүмкін болмады.',
    'bulk_update_sort_error' => 'Бөлім ретін жаңарту мүмкін емес.',

    // Клондау
    'cloned' => 'Бөлім сәтті клондалды.',
    'clone_error' => 'Бөлімді клондау қатесі.',

];
