<?php

// resources/lang/kk/admin/controllers/tags.php

return [

    'index_error' => 'Тегтер тізімі жүктелмеді.',

    // Жалпы әрекеттер
    'created' => 'Тег сәтті жасалды.',
    'create_error' => 'Тег жасау кезінде қате орын алды.',
    'updated' => 'Тег сәтті жаңартылды.',
    'update_error' => 'Тегті жаңарту кезінде қате орын алды.',
    'deleted' => 'Тег сәтті жойылды.',
    'delete_error' => 'Тегті жою кезінде қате орын алды.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған тегтер (:санау дана) сәтті жойылды.',
    'bulk_delete_error' => 'Тегтерді жою кезінде қате орын алды.',

    // Әрекет
    'activity' => '":title" :әрекетті белгілеңіз.',
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'update_activity_error' => 'Тег әрекетін жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_error' => 'Сұрыптауды жаңарту мүмкін болмады.',
    'bulk_update_sort_error' => 'Тегтер ретін жаңарту мүмкін болмады.',
];
