<?php

// resources/lang/kk/admin/controllers/categories.php

return [

    // Жүктеу қателері
    'index_error' => 'Санат тізімі жүктелмеді.',
    'index_locale_error' => 'Таңдалған тіл үшін санаттар тізімін жүктеу сәтсіз аяқталды.',
    'parent_load_error' => 'Ата-аналық санат тізімі жүктелмеді.',

    // Жалпы әрекеттер
    'created' => 'Санат сәтті жасалды.',
    'create_error' => 'Санат жасау кезінде қате орын алды.',
    'updated' => 'Санат сәтті жаңартылды.',
    'update_error' => 'Санатты жаңарту кезінде қате орын алды.',
    'deleted' => 'Санат сәтті жойылды.',
    'delete_error' => 'Санатты жою кезінде қате орын алды.',

    // Әрекет
    'activity' => '":title" санатының әрекет күйі жаңартылды: :action.',
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'update_activity_error' => 'Санат әрекетінің күйін жаңарту кезінде қате орын алды.',

    // Жаппай әрекетті жаңарту
    'bulk_update_activity_no_selection' => 'Әрекетті жаңарту үшін ешқандай санат таңдалмаған.',
    'bulk_update_activity_success' => 'Әрекет күйі :count санаттары үшін жаңартылды: :action.',
    'bulk_update_activity_error' => 'Санат белсенділігін жаппай жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_error' => 'Санаттарды сұрыптауды жаңарту кезінде қате орын алды.',
    'order_updated' => 'Санат тәртібі сәтті жаңартылды.',
    'bulk_update_sort_error' => 'Санат тәртібін жаңарту кезінде қате орын алды. Мәліметтеріңізді тексеріп, әрекетті қайталаңыз.',

    // Тексеру қателері
    'invalid_input' => 'Тапсырысты жаңарту үшін жарамсыз енгізу.',
    'invalid_category_ids' => 'Жарамсыз санат идентификаторлары табылды немесе санаттар таңдалған тілге жатпайды.',
    'invalid_parent_ids' => 'Жарамсыз ата-аналар санатының идентификаторлары табылды немесе ата-аналар таңдалған тілге жатпайды.',
    'parent_loop_error' => 'Категория өзінің ата-анасы бола алмайды.',
];
