<?php

// resources/lang/kk/admin/controllers/plugins.php

return [

    // Жалпы әрекеттер
    'created' => 'Модуль сәтті жасалды.',
    'updated' => 'Модуль сәтті жаңартылды.',
    'deleted' => 'Модуль сәтті жойылды.',

// Жасау/жаңарту/жою қателері
    'create_error' => 'Модуль жасау кезінде қате орын алды.',
    'update_error' => 'Модульді жаңарту кезінде қате орын алды.',
    'delete_error' => 'Модульді жою кезінде қате орын алды.',

// Тізім жүктелуде
    'index_load_error' => 'Модульдер тізімін жүктеу сәтсіз аяқталды.',

// Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => '":title" модулі :әрекет болды.',

// Әрекет қателері
    'update_activity_error' => 'Модуль әрекетін жаңарту кезінде қате орын алды.',

// Сұрыптау
    'update_sort_error' => 'Модуль сұрыптауын жаңарту мүмкін болмады.',
    'update_sort_bulk_error' => 'Модульдердің ретін жаңарту сәтсіз аяқталды.',

];
