<?php

// resources/lang/kk/admin/controllers/rubrics.php

return [

    // Жалпы әрекеттер
    'created' => 'Санат сәтті жасалды.',
    'updated' => 'Санат сәтті жаңартылды.',
    'deleted' => 'Санат сәтті жойылды.',
    'create_error' => 'Санат жасау кезінде қате орын алды.',
    'update_error' => 'Санатты жаңарту кезінде қате орын алды.',
    'delete_error' => 'Санатты жою кезінде қате орын алды.',

    // Жаппай операциялар
    'bulk_deleted' => 'Таңдалған санаттар (:санау дана) сәтті жойылды.',
    'bulk_delete_error' => 'Санаттарды жою кезінде қате орын алды.',

    // Әрекет
    'activated' => 'activated',
    'deactivated' => 'өшірілген',
    'activity' => '":title" санаты :әрекет болды.',
    'update_activity_error' => 'Әрекетті жаңарту кезінде қате орын алды.',

    // Сұрыптау
    'update_sort_error' => 'Сұрыптауды жаңарту мүмкін болмады.',
    'update_sort_bulk_error' => 'Санаттардың ретін жаңарту мүмкін емес.',

    // Клондау
    'cloned' => 'Санат сәтті клондалды.',
    'clone_error' => 'Санатты клондау қатесі.',
    'clone_title_error' => 'Қате: осы атауы мен тілі бар санат бұрыннан бар.',
    'clone_url_error' => 'Қате: осы URL мекенжайы мен тілі бар санат бұрыннан бар.',
    'clone_unique_error' => 'Клондау қатесі: бірегейлікті бұзу.',

    // Тізім жүктелуде
    'index_load_error' => 'Категориялар тізімі жүктелмеді.',

];
