<?php

// resources/lang/kk/admin/requests.php

return [
    // Сұрыптау
    'sort.required' => 'Сұрыптау мәні көрсетілуі керек.',
    'sort.integer' => 'Сұрыптау өрісі сан болуы керек.',
    'sort.min' => 'Сұрыптау өрісі теріс болуы мүмкін емес.',

    // Әрекет
    'activity.required' => 'Әрекет өрісі қажет.',
    'activity.boolean' => 'Әрекет өрісі логикалық мән болуы керек.',

    // Сол жақ баған
    'left.required' => '"Сол жақ баған" өрісі қажет.',
    'left.boolean' => '"Сол жақ баған" өрісі логикалық мән болуы керек.',

    // Негізгі
    'main.required' => '"Негізгі" өріс қажет.',
    'main.boolean' => '"Негізгі" өріс логикалық мән болуы керек.',

    // Оң жақ баған
    'right.required' => '"Оң жақтағы бағанда" өрісі қажет.',
    'right.boolean' => '"Оң жақ баған" өрісі логикалық мән болуы керек.',

    // Локализация
    'locale.required' => 'Тіл қажет.',
    'locale.string' => 'Тіл жол болуы керек.',
    'locale.size' => 'Тіл коды 2 таңбадан тұруы керек (мысалы, «ru», «en», «kz»).',
    'locale.in' => 'Жарамсыз тіл',

    // Аты
    'title.required' => 'Тақырып қажет.',
    'title.string' => 'Тақырып жол болуы керек.',
    'title.max' => 'Тақырып 255 таңбадан аспауы керек.',
    'title.unique' => 'Бұл тақырып пен тілде әлдеқашан бар.',

    // URL
    'url.required' => 'URL қажет.',
    'url.string' => 'URL жол болуы керек.',
    'url.max' => 'URL 500 таңбадан аспауы керек.',
    'url.regex' => 'URL тек латын әріптерін, сандарын және сызықшаларды қамтуы керек.',
    'url.unique' => 'бұл URL мекенжайы және тілі бұрыннан бар.',
    'link.string' => 'Сілтеме жол болуы керек.',
    'link.max' => 'Сілтеме тым ұзын.',
    'slug.required' => 'Тег slug қажет.',
    'slug.max' => 'Slug тегі :max таңбадан аспауы керек.',
    'slug.regex' => 'Слаг тек латын әріптерін, сандарын және сызықшаларды қамтуы керек.',
    'slug.unique' => 'Осы Slug және тілі бар тег бұрыннан бар.',

    // Көріністер
    'views.integer' => 'Көрулер сан болуы керек.',
    'views.min' => 'Көрулер теріс болуы мүмкін емес.',

    // Сипаттама
    'short.string' => 'Қысқа сипаттама жол болуы керек.',
    'short.max' => 'Қысқа сипаттама 255 таңбадан аспауы керек.',
    'description.string' => 'Сипаттама жол болуы керек.',
    'description.max' => 'Сипаттама тым ұзын.',

    // Түсініктемелер
    'comment.string' => 'Түсініктеме жол болуы керек.',
    'comment.max' => 'Түсініктеме :max таңбадан аспауы керек.',
    'user_id.exists' => 'Таңдалған пайдаланушы жоқ.',
    'commentable_id.required' => 'Түсініктеме қолданылатын нысан көрсетілмеген.',
    'commentable_type.required' => 'Түсініктеме қолданылатын нысан түрі көрсетілмеген.',
    'commentable_type.in' => 'Бұл нысан түріне түсініктеме беруге қолдау көрсетілмейді.',
    'content.required' => 'Түсініктеме мәтіні қажет.',
    'content.max' => 'Пікір мәтіні тым ұзын.',
    'approved.required' => 'Бекіту күйі қажет.',
    'approved.boolean' => 'Бекіту күйі Иә/Жоқ болуы керек',

    // Автор
    'author.string' => 'Автор аты жол болуы керек.',
    'author.max' => 'Автор аты 255 таңбадан аспауы керек.',

    // Жарияланған күні
    'published_at.date' => 'Жарияланған күн пішімі дұрыс емес.',
    'published_at.date_format' => 'Жарияланатын күн пішімі дұрыс емес (ЖЖЖЖ-АА-КК күтілуде).',

    // Мета SEO
    'meta_title.string' => 'Тақырыптың мета өрісі жол болуы керек.',
    'meta_title.max' => 'Мета тақырыбы 255 таңбадан аспауы керек.',
    'meta_keywords.string' => 'Мета кілт сөздер өрісі жол болуы керек.',
    'meta_keywords.max' => 'Мета кілт сөздері 255 таңбадан аспауы керек.',
    'meta_desc.string' => 'Мета сипаттамасы жол болуы керек.',

    // Бейне
    'duration.integer' => 'Бейне ұзақтығы бүтін сан (секунд) болуы керек',
    'duration.min' => 'Бейне ұзақтығы теріс болуы мүмкін емес.',
    'source_type.required' => 'Бейне көзі түрін таңдау керек.',
    'source_type.in' => 'Жарамсыз бейне көзі түрі таңдалды.',
    'external_video_id.required' => 'Сіз тек YouTube немесе Vimeo үшін сілтеме/идентификатор беруіңіз керек.',
    'external_video_id.max' => 'Идентификатор/сілтеме/код өрісі тым ұзын (макс:макс таңба).',
    'video_file.required' => 'Сіз жергілікті бейне үшін файлды жүктеп салуыңыз керек.',
    'video_file.file' => 'Бейне файлды жүктеуде мәселе.',
    'video_file.mimes' => 'Бейне файл пішімі жарамсыз. Рұқсат етілген: :мәндер.',
    'video_file.max' => 'Бейне файл тым үлкен (макс:макс КБ).',
    'video_url.required' => 'Сіз жергілікті бейне үшін URL мекенжайын көрсетуіңіз немесе «код» түріне код енгізуіңіз керек.',

    // Бөлімдер
    'sections.array' => 'Бөлімдер массив болуы керек.',
    'sections.*.id.required_with' => 'Бөлім идентификаторы қажет.',
    'sections.*.id.integer' => 'Бөлім идентификаторы сан болуы керек.',
    'sections.*.id.exists' => 'Жоқ бөлім таңдалды.',

    // Мақалалар
    'articles.*.id.required_with' => 'Мақаланың идентификаторы қажет.',
    'articles.*.id.exists' => 'Жоқ мақала таңдалды (ID: :value).',

    // Тегтер
    'tags.array' => 'Тегтер массив болуы керек.',
    'tags.*.id.required_with' => 'Тег идентификаторы қажет.',
    'tags.*.id.integer' => 'Тег идентификаторы сан болуы керек.',
    'tags.*.id.exists' => 'Болмайтын тег таңдалды.',

    // Ұсынылатын мақалалар
    'related_articles.array' => 'Байланысты мақалалар тізімі массив болуы керек.',
    'related_articles.*.id.required_with' => 'Қатысты мақала идентификаторы қажет.',
    'related_articles.*.id.integer' => 'Қатысты мақала идентификаторы сан болуы керек.',
    'related_articles.*.id.exists' => 'Болмайтын қатысты мақала таңдалды.',

    // Ұсынылатын бейнелер
    'related_videos.*.id.required_with' => 'Қатысты бейне идентификаторы қажет.',
    'related_videos.*.id.exists' => 'Болмайтын қатысты бейне (ID: :value) таңдалды.',
    'related_videos.*.id.where_not' => 'Бейненің өзіне қатысты болуы мүмкін емес.',

    // еншілес санаттар үшін
    'parent_id.exists' => 'Таңдалған ата-аналық санат жоқ немесе басқа тілге жатады.',
    'parent_id.not_in' => 'Санат өзінен-өзі еншілес бола алмайды.',
    'parent_id.integer' => 'Ата-аналық бет идентификаторы сан болуы керек.',

    // Тауарлар
    'is_new.required' => '"is_new" өрісі қажет.',
    'is_hit.required' => '"is_hit" өрісі қажет.',
    'is_sale.required' => '"is_sale" өрісі қажет.',
    'sku.max' => 'Мақаланың нөмірі 255 таңбадан аспауы керек.',
    'availability.max' => 'Қол жетімділік өрісі 255 таңбадан аспауы керек.',
    'barcode.max' => 'Штрих-код 255 таңбадан аспауы керек.',
    'price.numeric' => 'Баға сан болуы керек.',
    'old_price.numeric' => 'Ескі баға сан болуы керек.',
    'quantity.integer' => 'Саны бүтін сан болуы керек.',
    'quantity.min' => 'Саны 0-ден кем болмауы керек.',
    'weight.numeric' => 'Салмақ сан болуы керек.',
    'currency.max' => 'Валюта коды 3 таңбадан аспауы керек.',
    'admin.max' => 'Әкімші өрісі 255 таңбадан аспауы керек.',
    'categories.array' => 'Санаттарды массив ретінде беру керек.',
    'categories.*.id.required_with' => 'Әр санатта идентификатор болуы керек.',
    'categories.*.id.integer' => 'Санат идентификаторлары бүтін сандар болуы керек.',
    'categories.*.id.exists' => 'Жоқ санат таңдалды.',
    'related_products.array' => 'Ұсынылған өнімдер массив ретінде берілуі керек.',
    'related_products.*.id.required_with' => 'Әрбір ұсынылған өнімнің идентификаторы болуы керек.',
    'related_products.*.id.integer' => 'Ұсынылатын өнім идентификаторы бүтін сан болуы керек.',
    'related_products.*.id.exists' => 'Дерекқорда бір немесе бірнеше ұсынылған өнім табылмады.',
    'product_id.required' => 'Бұл өнімді таңдау қажет.',
    'product_id.exists' => 'Таңдалған өнім жоқ.',
    'weight.integer' => 'Салмақ бүтін сан болуы керек.',
    'currency.required' => 'Валюта өрісі қажет.',
    'currency.size' => 'Валюта 3 таңбадан тұруы керек.',
    'options.array' => 'Параметрлер массив болуы керек.',

    // Сипаттамалар
    'properties.array' => 'Сипаттар өрісі массив болуы керек.',
    'properties.*.id.required_with' => 'Меншік идентификаторы қажет.',
    'properties.*.id.integer' => 'Меншік идентификаторы сан болуы керек.',
    'properties.*.id.exists' => 'Көрсетілген сипат табылмады.',
    'property_group_id.integer' => 'Топ идентификаторы бүтін сан болуы керек.',
    'property_group_id.exists' => 'Таңдалған топ табылмады.',
    'property_values.array' => 'Сипаттар өрісі массив болуы керек.',
    'property_values.*.integer' => 'Әр сипат мәні сан болуы керек.',
    'property_values.*.exists' => 'Таңдалған сипат мәні жоқ.',
    'type.required' => 'Мүмкіндік түрін көрсетіңіз.',
    'type.string' => 'Тип жол болуы керек.',
    'type.max' => 'Түр 50 таңбадан аспауы керек.',
    'slug.string' => 'Слаг жол болуы керек.',
    'all_categories.required' => 'Мұның барлық санаттарға қатысты екенін көрсетіңіз.',
    'all_categories.boolean' => 'Мән логикалық болуы керек.',
    'is_filterable.required' => 'Мүмкіндіктің сүзуге болатынын көрсетіңіз.',
    'is_filterable.boolean' => 'Мән логикалық болуы керек.',
    'filter_type.required' => 'Сүзгі түрін көрсетіңіз.',
    'filter_type.string' => 'Сүзгі түрі жол болуы керек.',
    'filter_type.max' => 'Сүзгі түрі 50 таңбадан аспауы керек.',
    'property_id.required' => 'Сипат көрсетілуі керек.',
    'property_id.integer' => 'Сипаттар өрісі сан болуы керек.',
    'property_id.exists' => 'Көрсетілген сипат табылмады.',
    'value.unique' => 'Мұндай мән осы сипаттамада бұрыннан бар.',

    // Рұқсаттар мен рөлдер
    'permissions.array' => 'Рұқсаттар массив болуы керек.',
    'permissions.*.exists' => 'Болмайтын рұқсат таңдалды (ID: :value).',
    'roles.array' => 'Рөлдер массив болуы керек.',

    // Аты
    'name.required' => 'Аты қажет.',
    'name.string' => 'Атау жол болуы керек.',
    'name.max' => 'Атау :max таңбадан аспауы керек.',
    'name.unique' => 'Осындай атпен әлдеқашан бар.',

    // Күзет
    'guard_name.string' => 'Қорғау атауы жол болуы керек.',
    'guard_name.max' => 'Қорғау атауы :max таңбадан аспауы керек.',

    // Пайдаланушылар
    'email.required' => 'Электрондық пошта қажет.',
    'email.email' => 'Қате электрондық пошта пішімі.',
    'email.unique' => 'Бұл электрондық пошта бұрыннан тіркелген.',

    // Плагиндер
    'version.max' => 'Плагин нұсқасы :max таңбадан аспауы керек.',
    'readme.string' => 'README жол болуы керек.',
    'options.json' => 'Опциялар жарамды JSON жолы болуы керек.',
    'code.string' => 'Код жол болуы керек.',
    'code.max' => 'Код :max таңбадан аспауы керек.',
    'code.regex' => 'Кодта тек латын әріптері, сандар және астын сызулар болуы мүмкін.',
    'templates.max' => 'Үлгілер өрісі :max таңбадан аспауы керек.',

    // Параметрлер
    'type.in' => 'Жарамсыз өріс түрі таңдалды.',
    'option.required' => 'Опция қажет.',
    'option.unique' => 'Осы опциясы бар параметр бұрыннан бар.',
    'constant.required' => 'Тұрақты қажет.',
    'constant.unique' => 'Бұл тұрақты бар параметр бұрыннан бар.',
    'constant.regex' => 'Тұрақты латын бас әріпінен басталуы керек және тек БАС латын әріптерін, сандарды және астын сызуды қамтуы керек.',
    'value.required' => 'Міндетті сан.',
    'value.integer' => 'Саны бүтін сан болуы керек.',
    'value.min' => 'Саны кем дегенде: мин.',
    'value.string' => 'Мән жол болуы керек.',
    'value.max' => 'Мән тым ұзын.',

    // Белгіше
    'icon.string' => 'Белгіше жол болуы керек.',
    'icon.max' => 'Белгішенің мазмұны тым ұзын.',

    // Суреттер
    'images.array' => 'Суреттер массив болуы керек.',
    'images.*.id.integer' => 'Сурет идентификаторы сан болуы керек.',
    'images.*.id.exists' => 'Көрсетілген сурет жоқ.',
    'images.*.id.prohibited' => 'Сурет идентификаторын жасау кезінде жіберу мүмкін емес.',
    'images.*.order.integer' => 'Сурет реті сан болуы керек.',
    'images.*.order.min' => 'Сурет реті теріс болуы мүмкін емес.',
    'images.*.alt.string' => 'Image Alt мәтіні жол болуы керек.',
    'images.*.alt.max' => 'Басқа мәтін 255 таңбадан аспауы керек.',
    'images.*.caption.string' => 'Сурет тақырыбы жол болуы керек.',
    'images.*.caption.max' => 'Тақырып 255 таңбадан аспауы керек.',
    'images.*.file.required' => 'Жаңа кескіндер үшін кескін файлы қажет.',
    'images.*.file.file' => 'Сурет файлын жүктеуде мәселе.',
    'images.*.file.image' => 'Файл сурет болуы керек.',
    'images.*.file.mimes' => 'Файл jpeg, jpg, png, gif, svg немесе webp форматында болуы керек.',
    'images.*.file.max' => 'Сурет файлының өлшемі 10 МБ аспауы керек.',
    'images.*.file.required_without' => 'Жаңа кескіндер үшін сурет файлы қажет.',

    'deletedImages.array' => 'Жойылатын кескіндер тізімі массив болуы керек.',
    'deletedImages.*.integer' => 'Жойылатын кескіннің идентификаторы сан болуы керек.',
    'deletedImages.*.exists' => 'Жоқ суретті жою әрекеті.',
];
