<?php

// resources/lang/ru/admin/requests/SettingRequest.php

return [
    'sort.integer' => 'Поле сортировки должно быть числом.',
    'sort.min' => 'Поле сортировки не может быть отрицательным.',
    'activity.required' => 'Поле активности обязательно для заполнения.',
    'activity.boolean' => 'Поле активности должно быть логическим значением.',
    'type.in' => 'Выбран недопустимый тип поля.',
    'option.required' => 'Опция обязательна.',
    'option.unique' => 'Настройка с такой опцией уже существует.',
    'constant.required' => 'Константа обязательна.',
    'constant.unique' => 'Настройка с такой константой уже существует.',
    'constant.regex' => 'Константа должна начинаться с БОЛЬШОЙ латинской буквы и содержать только БОЛЬШИЕ латинские буквы, цифры и подчеркивания.',
];
