<?php

// resources/lang/kk/admin/requests/TagRequest.php

return [
    'locale.required' => 'Тэг тілі қажет.',
    'locale.in' => 'Қабылданатын тілдер: :мәндер.',

    'name.required' => 'Тег атауы қажет.',
    'name.max' => 'Тег аты :max таңбадан аспауы керек.',
    'name.unique' => 'Осы аты мен тілі бар тег бұрыннан бар.', // Бекітілген

    'slug.required' => 'Тег slug қажет.',
    'slug.max' => 'Slug тегі :max таңбадан аспауы керек.',
    'slug.regex' => 'Слаг тек латын әріптерін, сандарын және сызықшаларды қамтуы керек.', // Қосылды
    'slug.unique' => 'Осы Slug және тілі бар тег бұрыннан бар.', // Бекітілген

    'short.max' => 'Қысқа сипаттама :max таңбадан аспауы керек.',
    'description.string' => 'Сипаттама жол болуы керек.',

    'meta_title.max' => 'Мета тақырыбы :макс таңбадан аспауы керек.',
    'meta_keywords.max' => 'Мета кілт сөздері :макс таңбадан аспауы керек.',
    'meta_desc.string' => 'Мета сипаттамасы жол болуы керек.', // Бекітілген

    'sort.integer' => 'Сұрыптау өрісі сан болуы керек.',
    'sort.min' => 'Сұрыптау өрісі теріс болуы мүмкін емес.', // Қосылды
    'activity.required' => 'Әрекет өрісі қажет.',
    'activity.boolean' => 'Әрекет өрісі логикалық мән болуы керек.', // Қосылған

    'views.integer' => 'Көрулер сан болуы керек.', // Қосылды
    'views.min' => 'Көрулер теріс болуы мүмкін емес.', // Қосылған
];
