<?php

// resources/lang/ru/admin/controllers/permissions.php

return [

    'index_error' => 'Не удалось загрузить список разрешений.',

    // Общие действия
    'created' => 'Разрешение успешно создано.',
    'updated' => 'Разрешение успешно обновлено.',
    'deleted' => 'Разрешение успешно удалено.',

    // Ошибки
    'create_error' => 'Произошла ошибка при создании разрешения.',
    'update_error' => 'Произошла ошибка при обновлении разрешения.',
    'delete_error' => 'Произошла ошибка при удалении разрешения.',

];
