<?php

// resources/lang/ru/admin/controllers/roles.php

return [

    // Общие действия
    'created' => 'Роль успешно создана.',
    'updated' => 'Роль успешно обновлена.',
    'deleted' => 'Роль успешно удалена.',

    // Ошибки создания/обновления/удаления
    'create_error' => 'Произошла ошибка при создании роли.',
    'update_error' => 'Произошла ошибка при обновлении роли.',
    'delete_error' => 'Произошла ошибка при удалении роли.',

    // Ошибки удаления базовых ролей
    'delete_main_role_error' => 'Удаление основной роли запрещено.',
    'delete_base_role_error' => 'Запрещено удалять базовые роли.',

    // Загрузка списка
    'index_load_error' => 'Не удалось загрузить список ролей.',

];
