<?php

// resources/lang/ru/admin/controllers/rubrics.php

return [

    // Общие действия
    'created' => 'Рубрика успешно создана.',
    'updated' => 'Рубрика успешно обновлена.',
    'deleted' => 'Рубрика успешно удалена.',
    'create_error' => 'Произошла ошибка при создании рубрики.',
    'update_error' => 'Произошла ошибка при обновлении рубрики.',
    'delete_error' => 'Произошла ошибка при удалении рубрики.',

    // Массовые операции
    'bulk_deleted' => 'Выбранные рубрики (:count шт.) успешно удалены.',
    'bulk_delete_error' => 'Произошла ошибка при удалении рубрик.',

    // Активность
    'activated' => 'активирована',
    'deactivated' => 'деактивирована',
    'activity' => 'Рубрика ":title" была :action.',
    'update_activity_error' => 'Произошла ошибка при обновлении активности.',

    // Сортировка
    'update_sort_error' => 'Не удалось обновить сортировку.',
    'update_sort_bulk_error' => 'Не удалось обновить порядок рубрик.',

    // Клонирование
    'cloned' => 'Рубрика успешно клонирована.',
    'clone_error' => 'Ошибка клонирования рубрики.',
    'clone_title_error' => 'Ошибка: Рубрика с таким Названием и Языком уже существует.',
    'clone_url_error' => 'Ошибка: Рубрика с таким URL и Языком уже существует.',
    'clone_unique_error' => 'Ошибка клонирования: Нарушение уникальности.',

    // Загрузка списка
    'index_load_error' => 'Не удалось загрузить список рубрик.',

];
